<!-- dflook/terraform-github-actions {"workspace":"fix-root-tool-versions","backend_type":"remote","plan_modifier":"051a6df03c1b94ddb53b9a5329a560edecfe2c5bcd6a6a36ac0b75d175265fcb","backend":"3fc0b3fada0324ccb892e36a954ba03a59e4d9bfeee4b823f48832dca168a0d3","plan_job_ref":"Job Test plan target and replace #405 at https://github.com/dflook/terraform-github-actions/actions/runs/7555582505","plan_hash":"f2f48c07ec2bb3d05baa90f30dab0fe4db03b2ed48ffc2783cdf07d0c6d2e23f","plan_text_format":"diff","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-target-replace__ in the __fix-root-tool-versions__ workspace
Replacing resources: `random_string.foreach["hello"]`, `random_string.count[0]`
With variables: `length = 10`
<details>
<summary>Plan: 2 to add, 0 to change, 2 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # random_string.count[0] will be replaced, as requested
-/+ resource "random_string" "count" {
!~      id          = "**********" -> (known after apply)
!~      result      = "**********" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

  # random_string.foreach["hello"] will be replaced, as requested
-/+ resource "random_string" "foreach" {
!~      id          = "**********" -> (known after apply)
!~      result      = "**********" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
!~  count   = "gkJRnuKfTP" -> (known after apply)
!~  foreach = "mssEeQZnK7" -> (known after apply)
```
</details>

:memo: Plan generated in [Test plan target and replace #405](https://github.com/dflook/terraform-github-actions/actions/runs/7555582505)